app/Http/Controllers/AuthController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Rihangg', 'rihanafrizal59@gmail.com', '$2y$12$4V/7ggdR9CzUwAifqFokae8DS2o5H4wn2PCMk8p0qCKwTND8Yq7nm', '2025-09-19 10:58:30', '2025-09-19 10:58:30')
---
    public function register(Request $request)
    {
        $validated = $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'email', 'unique:users,email'],
            'password' => ['required', 'confirmed', 'min:6'],
        ]);

        $user = User::create([
            'name' => $validated['name'],
            'email' => $validated['email'],
            'password' => bcrypt($validated['password']),
        ]);